Autodesk.Revit.DB.IFC.IFCHybridImport.UpdateElements(Autodesk.Revit.DB.Document,System.String)
Updates IFC Elements using AnyCAD.
doc:
Document to receive elements from the IFC file update.
file:
Full path of the file to import.
Returns:
Returns an array of ElementIds representing created or updated elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.IFC.IFCHybridImport.ImportElements(Autodesk.Revit.DB.Document,System.String)
Imports IFC Elements using AnyCAD.
doc:
Document to receive elements from the IFC file import.
file:
Full path of the file to import.
Returns:
Returns an array of ElementIds representing created elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024